Revit 2015 API
RebarHookType.GetDefaultHookLength Method
 Computes the default hook length, which is equal to barDiameter * multiplier. This method is obsolete in Revit 2015. Use getDefaultHookExtension instead.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
[ObsoleteAttribute]
public double GetDefaultHookLength(
	double barDiameter
)
Visual Basic
<ObsoleteAttribute> _
Public Function GetDefaultHookLength ( _
	barDiameter As Double _
) As Double
Visual C++
[ObsoleteAttribute]
public:
double GetDefaultHookLength(
	double barDiameter
)
Parameters
barDiameter
Type: System.Double
See Also
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace